In [3]:
pip install pydataset

Collecting pydataset
Requirement already satisfied: pandas in /usr/local/anaconda3/lib/python3.7/site-packages (from pydataset) (0.24.2)
Requirement already satisfied: numpy>=1.12.0 in /usr/local/anaconda3/lib/python3.7/site-packages (from pandas->pydataset) (1.16.4)
Requirement already satisfied: python-dateutil>=2.5.0 in /usr/local/anaconda3/lib/python3.7/site-packages (from pandas->pydataset) (2.8.0)
Requirement already satisfied: pytz>=2011k in /usr/local/anaconda3/lib/python3.7/site-packages (from pandas->pydataset) (2019.1)
Requirement already satisfied: six>=1.5 in /usr/local/anaconda3/lib/python3.7/site-packages (from python-dateutil>=2.5.0->pandas->pydataset) (1.12.0)
Installing collected packages: pydataset
Successfully installed pydataset-0.2.0
Note: you may need to restart the kernel to use updated packages.

In [4]:
from pydataset import data

initiated datasets repo at: /Users/mattsantos/.pydataset/

In [5]:
# data('mpg', show_doc=True) # view the documentation for the dataset
mpg = data('mpg') # load the dataset and store it in a variable

In [6]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [7]:
df['passing_english'] = df.english > 60

In [8]:
df

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81             True
7     Marie    93       63       90             True
8    Albert    92       62       87             True
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72             True

In [9]:
#Sort the english grades by the passing_english column. How are duplicates handled?

In [11]:
#Sort the english grades first by passing_english and then by student name. All the students that are failing 
#english should be first, and within the students that are failing english they should be ordered alphabetically. 
#The same should be true for the students passing english. (Hint: you can pass a list to the .sort_values method)

df.sort_values(by=['name'])

       name  math  english  reading  passing_english
4       Ada    77       92       98             True
11     Alan    92       62       72             True
8    Albert    92       62       87             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
7     Marie    93       63       90             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True
6    Thomas    82       64       81             True

In [12]:
df.sort_values(by= ["passing_english", "english"])

       name  math  english  reading  passing_english
8    Albert    92       62       87             True
11     Alan    92       62       72             True
7     Marie    93       63       90             True
6    Thomas    82       64       81             True
2     Suzie    94       74       95             True
5      John    79       76       93             True
1      Jane    88       79       67             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True

In [13]:
##Calculate each students overall grade and add it as a column on the dataframe. The overall grade 
#is the average of the math, english, and reading grades.

df["Grade Average"] = df[['math', 'english', 'reading']].mean(axis=1)
df

       name  math  english  reading  passing_english  Grade Average
0     Sally    62       85       80             True      75.666667
1      Jane    88       79       67             True      78.000000
2     Suzie    94       74       95             True      87.666667
3     Billy    98       96       88             True      94.000000
4       Ada    77       92       98             True      89.000000
5      John    79       76       93             True      82.666667
6    Thomas    82       64       81             True      75.666667
7     Marie    93       63       90             True      82.000000
8    Albert    92       62       87             True      80.333333
9   Richard    69       80       94             True      81.000000
10    Isaac    92       99       93             True      94.666667
11     Alan    92       62       72             True      75.333333

In [15]:
from pydataset import mpg

ImportError: cannot import name 'mpg' from 'pydataset' (/usr/local/anaconda3/lib/python3.7/site-packages/pydataset/__init__.py)

In [16]:
print(mpg)

    manufacturer                   model  displ  year  cyl       trans drv  \
1           audi                      a4    1.8  1999    4    auto(l5)   f
2           audi                      a4    1.8  1999    4  manual(m5)   f
3           audi                      a4    2.0  2008    4  manual(m6)   f
4           audi                      a4    2.0  2008    4    auto(av)   f
5           audi                      a4    2.8  1999    6    auto(l5)   f
6           audi                      a4    2.8  1999    6  manual(m5)   f
7           audi                      a4    3.1  2008    6    auto(av)   f
8           audi              a4 quattro    1.8  1999    4  manual(m5)   4
9           audi              a4 quattro    1.8  1999    4    auto(l5)   4
10          audi              a4 quattro    2.0  2008    4  manual(m6)   4
11          audi              a4 quattro    2.0  2008    4    auto(s6)   4
12          audi              a4 quattro    2.8  1999    6    auto(l5)   4
13          audi              a4 quattro    2.8  1999    6  manual(m5)   4
14          audi              a4 quattro    3.1  2008    6    auto(s6)   4
15          audi              a4 quattro    3.1  2008    6  manual(m6)   4
16          audi              a6 quattro    2.8  1999    6    auto(l5)   4
17          audi              a6 quattro    3.1  2008    6    auto(s6)   4
18          audi              a6 quattro    4.2  2008    8    auto(s6)   4
19     chevrolet      c1500 suburban 2wd    5.3  2008    8    auto(l4)   r
20     chevrolet      c1500 suburban 2wd    5.3  2008    8    auto(l4)   r
21     chevrolet      c1500 suburban 2wd    5.3  2008    8    auto(l4)   r
22     chevrolet      c1500 suburban 2wd    5.7  1999    8    auto(l4)   r
23     chevrolet      c1500 suburban 2wd    6.0  2008    8    auto(l4)   r
24     chevrolet                corvette    5.7  1999    8  manual(m6)   r
25     chevrolet                corvette    5.7  1999    8    auto(l4)   r
26     chevrolet                corvette    6.2  2008    8  manual(m6)   r
27     chevrolet                corvette    6.2  2008    8    auto(s6)   r
28     chevrolet                corvette    7.0  2008    8  manual(m6)   r
29     chevrolet         k1500 tahoe 4wd    5.3  2008    8    auto(l4)   4
30     chevrolet         k1500 tahoe 4wd    5.3  2008    8    auto(l4)   4
31     chevrolet         k1500 tahoe 4wd    5.7  1999    8    auto(l4)   4
32     chevrolet         k1500 tahoe 4wd    6.5  1999    8    auto(l4)   4
33     chevrolet                  malibu    2.4  1999    4    auto(l4)   f
34     chevrolet                  malibu    2.4  2008    4    auto(l4)   f
35     chevrolet                  malibu    3.1  1999    6    auto(l4)   f
36     chevrolet                  malibu    3.5  2008    6    auto(l4)   f
37     chevrolet                  malibu    3.6  2008    6    auto(s6)   f
38         dodge             caravan 2wd    2.4  1999    4    auto(l3)   f
39         dodge             caravan 2wd    3.0  1999    6    auto(l4)   f
40         dodge             caravan 2wd    3.3  1999    6    auto(l4)   f
41         dodge             caravan 2wd    3.3  1999    6    auto(l4)   f
42         dodge             caravan 2wd    3.3  2008    6    auto(l4)   f
43         dodge             caravan 2wd    3.3  2008    6    auto(l4)   f
44         dodge             caravan 2wd    3.3  2008    6    auto(l4)   f
45         dodge             caravan 2wd    3.8  1999    6    auto(l4)   f
46         dodge             caravan 2wd    3.8  1999    6    auto(l4)   f
47         dodge             caravan 2wd    3.8  2008    6    auto(l6)   f
48         dodge             caravan 2wd    4.0  2008    6    auto(l6)   f
49         dodge       dakota pickup 4wd    3.7  2008    6  manual(m6)   4
50         dodge       dakota pickup 4wd    3.7  2008    6    auto(l4)   4
51         dodge       dakota pickup 4wd    3.9  1999    6    auto(l4)   4
52         dodge       dakota pickup 4wd    3.9  1999    6  manual(m5)   4
53         dodge       dakota pickup 4wd    4.7  2008    8    auto(l5)   4
54         dodge       dakota pickup 4wd    4.7  2008    8    auto(l5)   4
55         dodge       dakota pickup 4wd    4.7  2008    8    auto(l5)   4
56         dodge       dakota pickup 4wd    5.2  1999    8  manual(m5)   4
57         dodge       dakota pickup 4wd    5.2  1999    8    auto(l4)   4
58         dodge             durango 4wd    3.9  1999    6    auto(l4)   4
59         dodge             durango 4wd    4.7  2008    8    auto(l5)   4
60         dodge             durango 4wd    4.7  2008    8    auto(l5)   4
61         dodge             durango 4wd    4.7  2008    8    auto(l5)   4
62         dodge             durango 4wd    5.2  1999    8    auto(l4)   4
63         dodge             durango 4wd    5.7  2008    8    auto(l5)   4
64         dodge             durango 4wd    5.9  1999    8    auto(l4)   4
65         dodge     ram 1500 pickup 4wd    4.7  2008    8  manual(m6)   4
66         dodge     ram 1500 pickup 4wd    4.7  2008    8    auto(l5)   4
67         dodge     ram 1500 pickup 4wd    4.7  2008    8    auto(l5)   4
68         dodge     ram 1500 pickup 4wd    4.7  2008    8    auto(l5)   4
69         dodge     ram 1500 pickup 4wd    4.7  2008    8  manual(m6)   4
70         dodge     ram 1500 pickup 4wd    4.7  2008    8  manual(m6)   4
71         dodge     ram 1500 pickup 4wd    5.2  1999    8    auto(l4)   4
72         dodge     ram 1500 pickup 4wd    5.2  1999    8  manual(m5)   4
73         dodge     ram 1500 pickup 4wd    5.7  2008    8    auto(l5)   4
74         dodge     ram 1500 pickup 4wd    5.9  1999    8    auto(l4)   4
75          ford          expedition 2wd    4.6  1999    8    auto(l4)   r
76          ford          expedition 2wd    5.4  1999    8    auto(l4)   r
77          ford          expedition 2wd    5.4  2008    8    auto(l6)   r
78          ford            explorer 4wd    4.0  1999    6    auto(l5)   4
79          ford            explorer 4wd    4.0  1999    6  manual(m5)   4
80          ford            explorer 4wd    4.0  1999    6    auto(l5)   4
81          ford            explorer 4wd    4.0  2008    6    auto(l5)   4
82          ford            explorer 4wd    4.6  2008    8    auto(l6)   4
83          ford            explorer 4wd    5.0  1999    8    auto(l4)   4
84          ford         f150 pickup 4wd    4.2  1999    6    auto(l4)   4
85          ford         f150 pickup 4wd    4.2  1999    6  manual(m5)   4
..           ...                     ...    ...   ...  ...         ...  ..
150       nissan                  maxima    3.5  2008    6    auto(av)   f
151       nissan          pathfinder 4wd    3.3  1999    6    auto(l4)   4
152       nissan          pathfinder 4wd    3.3  1999    6  manual(m5)   4
153       nissan          pathfinder 4wd    4.0  2008    6    auto(l5)   4
154       nissan          pathfinder 4wd    5.6  2008    8    auto(s5)   4
155      pontiac              grand prix    3.1  1999    6    auto(l4)   f
156      pontiac              grand prix    3.8  1999    6    auto(l4)   f
157      pontiac              grand prix    3.8  1999    6    auto(l4)   f
158      pontiac              grand prix    3.8  2008    6    auto(l4)   f
159      pontiac              grand prix    5.3  2008    8    auto(s4)   f
160       subaru            forester awd    2.5  1999    4  manual(m5)   4
161       subaru            forester awd    2.5  1999    4    auto(l4)   4
162       subaru            forester awd    2.5  2008    4  manual(m5)   4
163       subaru            forester awd    2.5  2008    4  manual(m5)   4
164       subaru            forester awd    2.5  2008    4    auto(l4)   4
165       subaru            forester awd    2.5  2008    4    auto(l4)   4
166       subaru             impreza awd    2.2  1999    4    auto(l4)   4
167       subaru             impreza awd    2.2  1999    4  manual(m5)   4
168       subaru             impreza awd    2.5  1999    4  manual(m5)   4
169       subaru             impreza awd    2.5  1999    4    auto(l4)   4
170       subaru             impreza awd    2.5  2008    4    auto(s4)   4
171       subaru             impreza awd    2.5  2008    4    auto(s4)   4
172       subaru             impreza awd    2.5  2008    4  manual(m5)   4
173       subaru             impreza awd    2.5  2008    4  manual(m5)   4
174       toyota             4runner 4wd    2.7  1999    4  manual(m5)   4
175       toyota             4runner 4wd    2.7  1999    4    auto(l4)   4
176       toyota             4runner 4wd    3.4  1999    6    auto(l4)   4
177       toyota             4runner 4wd    3.4  1999    6  manual(m5)   4
178       toyota             4runner 4wd    4.0  2008    6    auto(l5)   4
179       toyota             4runner 4wd    4.7  2008    8    auto(l5)   4
180       toyota                   camry    2.2  1999    4  manual(m5)   f
181       toyota                   camry    2.2  1999    4    auto(l4)   f
182       toyota                   camry    2.4  2008    4  manual(m5)   f
183       toyota                   camry    2.4  2008    4    auto(l5)   f
184       toyota                   camry    3.0  1999    6    auto(l4)   f
185       toyota                   camry    3.0  1999    6  manual(m5)   f
186       toyota                   camry    3.5  2008    6    auto(s6)   f
187       toyota            camry solara    2.2  1999    4    auto(l4)   f
188       toyota            camry solara    2.2  1999    4  manual(m5)   f
189       toyota            camry solara    2.4  2008    4  manual(m5)   f
190       toyota            camry solara    2.4  2008    4    auto(s5)   f
191       toyota            camry solara    3.0  1999    6    auto(l4)   f
192       toyota            camry solara    3.0  1999    6  manual(m5)   f
193       toyota            camry solara    3.3  2008    6    auto(s5)   f
194       toyota                 corolla    1.8  1999    4    auto(l3)   f
195       toyota                 corolla    1.8  1999    4    auto(l4)   f
196       toyota                 corolla    1.8  1999    4  manual(m5)   f
197       toyota                 corolla    1.8  2008    4  manual(m5)   f
198       toyota                 corolla    1.8  2008    4    auto(l4)   f
199       toyota  land cruiser wagon 4wd    4.7  1999    8    auto(l4)   4
200       toyota  land cruiser wagon 4wd    5.7  2008    8    auto(s6)   4
201       toyota       toyota tacoma 4wd    2.7  1999    4  manual(m5)   4
202       toyota       toyota tacoma 4wd    2.7  1999    4    auto(l4)   4
203       toyota       toyota tacoma 4wd    2.7  2008    4  manual(m5)   4
204       toyota       toyota tacoma 4wd    3.4  1999    6  manual(m5)   4
205       toyota       toyota tacoma 4wd    3.4  1999    6    auto(l4)   4
206       toyota       toyota tacoma 4wd    4.0  2008    6  manual(m6)   4
207       toyota       toyota tacoma 4wd    4.0  2008    6    auto(l5)   4
208   volkswagen                     gti    2.0  1999    4  manual(m5)   f
209   volkswagen                     gti    2.0  1999    4    auto(l4)   f
210   volkswagen                     gti    2.0  2008    4  manual(m6)   f
211   volkswagen                     gti    2.0  2008    4    auto(s6)   f
212   volkswagen                     gti    2.8  1999    6  manual(m5)   f
213   volkswagen                   jetta    1.9  1999    4  manual(m5)   f
214   volkswagen                   jetta    2.0  1999    4  manual(m5)   f
215   volkswagen                   jetta    2.0  1999    4    auto(l4)   f
216   volkswagen                   jetta    2.0  2008    4    auto(s6)   f
217   volkswagen                   jetta    2.0  2008    4  manual(m6)   f
218   volkswagen                   jetta    2.5  2008    5    auto(s6)   f
219   volkswagen                   jetta    2.5  2008    5  manual(m5)   f
220   volkswagen                   jetta    2.8  1999    6    auto(l4)   f
221   volkswagen                   jetta    2.8  1999    6  manual(m5)   f
222   volkswagen              new beetle    1.9  1999    4  manual(m5)   f
223   volkswagen              new beetle    1.9  1999    4    auto(l4)   f
224   volkswagen              new beetle    2.0  1999    4  manual(m5)   f
225   volkswagen              new beetle    2.0  1999    4    auto(l4)   f
226   volkswagen              new beetle    2.5  2008    5  manual(m5)   f
227   volkswagen              new beetle    2.5  2008    5    auto(s6)   f
228   volkswagen                  passat    1.8  1999    4  manual(m5)   f
229   volkswagen                  passat    1.8  1999    4    auto(l5)   f
230   volkswagen                  passat    2.0  2008    4    auto(s6)   f
231   volkswagen                  passat    2.0  2008    4  manual(m6)   f
232   volkswagen                  passat    2.8  1999    6    auto(l5)   f
233   volkswagen                  passat    2.8  1999    6  manual(m5)   f
234   volkswagen                  passat    3.6  2008    6    auto(s6)   f

     cty  hwy fl       class
1     18   29  p     compact
2     21   29  p     compact
3     20   31  p     compact
4     21   30  p     compact
5     16   26  p     compact
6     18   26  p     compact
7     18   27  p     compact
8     18   26  p     compact
9     16   25  p     compact
10    20   28  p     compact
11    19   27  p     compact
12    15   25  p     compact
13    17   25  p     compact
14    17   25  p     compact
15    15   25  p     compact
16    15   24  p     midsize
17    17   25  p     midsize
18    16   23  p     midsize
19    14   20  r         suv
20    11   15  e         suv
21    14   20  r         suv
22    13   17  r         suv
23    12   17  r         suv
24    16   26  p     2seater
25    15   23  p     2seater
26    16   26  p     2seater
27    15   25  p     2seater
28    15   24  p     2seater
29    14   19  r         suv
30    11   14  e         suv
31    11   15  r         suv
32    14   17  d         suv
33    19   27  r     midsize
34    22   30  r     midsize
35    18   26  r     midsize
36    18   29  r     midsize
37    17   26  r     midsize
38    18   24  r     minivan
39    17   24  r     minivan
40    16   22  r     minivan
41    16   22  r     minivan
42    17   24  r     minivan
43    17   24  r     minivan
44    11   17  e     minivan
45    15   22  r     minivan
46    15   21  r     minivan
47    16   23  r     minivan
48    16   23  r     minivan
49    15   19  r      pickup
50    14   18  r      pickup
51    13   17  r      pickup
52    14   17  r      pickup
53    14   19  r      pickup
54    14   19  r      pickup
55     9   12  e      pickup
56    11   17  r      pickup
57    11   15  r      pickup
58    13   17  r         suv
59    13   17  r         suv
60     9   12  e         suv
61    13   17  r         suv
62    11   16  r         suv
63    13   18  r         suv
64    11   15  r         suv
65    12   16  r      pickup
66     9   12  e      pickup
67    13   17  r      pickup
68    13   17  r      pickup
69    12   16  r      pickup
70     9   12  e      pickup
71    11   15  r      pickup
72    11   16  r      pickup
73    13   17  r      pickup
74    11   15  r      pickup
75    11   17  r         suv
76    11   17  r         suv
77    12   18  r         suv
78    14   17  r         suv
79    15   19  r         suv
80    14   17  r         suv
81    13   19  r         suv
82    13   19  r         suv
83    13   17  r         suv
84    14   17  r      pickup
85    14   17  r      pickup
..   ...  ... ..         ...
150   19   25  p     midsize
151   14   17  r         suv
152   15   17  r         suv
153   14   20  p         suv
154   12   18  p         suv
155   18   26  r     midsize
156   16   26  p     midsize
157   17   27  r     midsize
158   18   28  r     midsize
159   16   25  p     midsize
160   18   25  r         suv
161   18   24  r         suv
162   20   27  r         suv
163   19   25  p         suv
164   20   26  r         suv
165   18   23  p         suv
166   21   26  r  subcompact
167   19   26  r  subcompact
168   19   26  r  subcompact
169   19   26  r  subcompact
170   20   25  p     compact
171   20   27  r     compact
172   19   25  p     compact
173   20   27  r     compact
174   15   20  r         suv
175   16   20  r         suv
176   15   19  r         suv
177   15   17  r         suv
178   16   20  r         suv
179   14   17  r         suv
180   21   29  r     midsize
181   21   27  r     midsize
182   21   31  r     midsize
183   21   31  r     midsize
184   18   26  r     midsize
185   18   26  r     midsize
186   19   28  r     midsize
187   21   27  r     compact
188   21   29  r     compact
189   21   31  r     compact
190   22   31  r     compact
191   18   26  r     compact
192   18   26  r     compact
193   18   27  r     compact
194   24   30  r     compact
195   24   33  r     compact
196   26   35  r     compact
197   28   37  r     compact
198   26   35  r     compact
199   11   15  r         suv
200   13   18  r         suv
201   15   20  r      pickup
202   16   20  r      pickup
203   17   22  r      pickup
204   15   17  r      pickup
205   15   19  r      pickup
206   15   18  r      pickup
207   16   20  r      pickup
208   21   29  r     compact
209   19   26  r     compact
210   21   29  p     compact
211   22   29  p     compact
212   17   24  r     compact
213   33   44  d     compact
214   21   29  r     compact
215   19   26  r     compact
216   22   29  p     compact
217   21   29  p     compact
218   21   29  r     compact
219   21   29  r     compact
220   16   23  r     compact
221   17   24  r     compact
222   35   44  d  subcompact
223   29   41  d  subcompact
224   21   29  r  subcompact
225   19   26  r  subcompact
226   20   28  r  subcompact
227   20   29  r  subcompact
228   21   29  p     midsize
229   18   29  p     midsize
230   19   28  p     midsize
231   21   29  p     midsize
232   16   26  p     midsize
233   18   26  p     midsize
234   17   26  p     midsize

[234 rows x 11 columns]

In [17]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
manufacturer    234 non-null object
model           234 non-null object
displ           234 non-null float64
year            234 non-null int64
cyl             234 non-null int64
trans           234 non-null object
drv             234 non-null object
cty             234 non-null int64
hwy             234 non-null int64
fl              234 non-null object
class           234 non-null object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [26]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [24]:
df= pd.DataFrame(mpg)

In [29]:
mpg.DataFrame()

AttributeError: 'DataFrame' object has no attribute 'DataFrame'